/**************************************************************************************
实验现象：下载程序后"LED&交通灯模块"的D1-D8呈现流水灯效果
接线说明： 单片机-->LED&交通灯模块(具体接线图可见开发攻略对应实验的“实验现象”章节)
		   P00-->D1
		   P01-->D2	
		   ...
		   P07-->D8
注意事项：																				  
***************************************************************************************/

#include "reg52.h"			 //此文件中定义了单片机的一些特殊功能寄存器

#define GPIO_DIG P0

typedef unsigned int u16;	  //对数据类型进行声明定义
typedef unsigned char u8;

u8 code smgduan[17]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,
					0x80,0x90,0x88,0x83,0xc6,0xa1,0x86,0x8e};

/*******************************************************************************
* 函 数 名         : delay
* 函数功能		   : 延时函数，i=1时，大约延时10us
*******************************************************************************/
void delay(u16 i)
{
	while(i--);	
}

/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{
	while(1)
	{
		u8 i;
		//u8 j;
		for(i=0;i<16;i++)
		{

		GPIO_DIG=~smgduan[i];
		delay(10000);
		GPIO_DIG=0x00;
		
		}
		delay(100000);
		GPIO_DIG=0xFF;
	}
}
